Table of Contents
 Class ListOfResultOfMember
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
List of result of member
[Obsolete]
public class ListOfResultOfMember : List<ResultOnMember>, IList<ResultOnMember>, ICollection<ResultOnMember>, IReadOnlyList<ResultOnMember>, IReadOnlyCollection<ResultOnMember>, IEnumerable<ResultOnMember>, IList, ICollection, IEnumerable
Inheritance
object
List<ResultOnMember>
ListOfResultOfMember
Implements
IList<ResultOnMember>
ICollection<ResultOnMember>
IReadOnlyList<ResultOnMember>
IReadOnlyCollection<ResultOnMember>
IEnumerable<ResultOnMember>
IList
ICollection
IEnumerable
Inherited Members
 List<ResultOnMember>.Add(ResultOnMember)
 List<ResultOnMember>.AddRange(IEnumerable<ResultOnMember>)
 List<ResultOnMember>.AsReadOnly()
 List<ResultOnMember>.BinarySearch(ResultOnMember)
 List<ResultOnMember>.BinarySearch(ResultOnMember, IComparer<ResultOnMember>)
 List<ResultOnMember>.BinarySearch(int, int, ResultOnMember, IComparer<ResultOnMember>)
 List<ResultOnMember>.Clear()
 List<ResultOnMember>.Contains(ResultOnMember)
 List<ResultOnMember>.ConvertAll<TOutput>(Converter<ResultOnMember, TOutput>)
 List<ResultOnMember>.CopyTo(ResultOnMember[])
 List<ResultOnMember>.CopyTo(ResultOnMember[], int)
 List<ResultOnMember>.CopyTo(int, ResultOnMember[], int, int)
 List<ResultOnMember>.Exists(Predicate<ResultOnMember>)
 List<ResultOnMember>.Find(Predicate<ResultOnMember>)
 List<ResultOnMember>.FindAll(Predicate<ResultOnMember>)
 List<ResultOnMember>.FindIndex(int, int, Predicate<ResultOnMember>)
 List<ResultOnMember>.FindIndex(int, Predicate<ResultOnMember>)
 List<ResultOnMember>.FindIndex(Predicate<ResultOnMember>)
 List<ResultOnMember>.FindLast(Predicate<ResultOnMember>)
 List<ResultOnMember>.FindLastIndex(int, int, Predicate<ResultOnMember>)
 List<ResultOnMember>.FindLastIndex(int, Predicate<ResultOnMember>)
 List<ResultOnMember>.FindLastIndex(Predicate<ResultOnMember>)
 List<ResultOnMember>.ForEach(Action<ResultOnMember>)
 List<ResultOnMember>.GetEnumerator()
 List<ResultOnMember>.GetRange(int, int)
 List<ResultOnMember>.IndexOf(ResultOnMember)
 List<ResultOnMember>.IndexOf(ResultOnMember, int)
 List<ResultOnMember>.IndexOf(ResultOnMember, int, int)
 List<ResultOnMember>.Insert(int, ResultOnMember)
 List<ResultOnMember>.InsertRange(int, IEnumerable<ResultOnMember>)
 List<ResultOnMember>.LastIndexOf(ResultOnMember)
 List<ResultOnMember>.LastIndexOf(ResultOnMember, int)
 List<ResultOnMember>.LastIndexOf(ResultOnMember, int, int)
 List<ResultOnMember>.Remove(ResultOnMember)
 List<ResultOnMember>.RemoveAll(Predicate<ResultOnMember>)
 List<ResultOnMember>.RemoveAt(int)
 List<ResultOnMember>.RemoveRange(int, int)
 List<ResultOnMember>.Reverse()
 List<ResultOnMember>.Reverse(int, int)
 List<ResultOnMember>.Sort()
 List<ResultOnMember>.Sort(IComparer<ResultOnMember>)
 List<ResultOnMember>.Sort(Comparison<ResultOnMember>)
 List<ResultOnMember>.Sort(int, int, IComparer<ResultOnMember>)
 List<ResultOnMember>.ToArray()
 List<ResultOnMember>.TrimExcess()
 List<ResultOnMember>.TrueForAll(Predicate<ResultOnMember>)
 List<ResultOnMember>.Capacity
 List<ResultOnMember>.Count
 List<ResultOnMember>.this[int]
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Methods
 GetSchema()
Gets schema
public XmlSchema GetSchema()
Returns
XmlSchema
 ReadXml(XmlReader)
Reads XML
public void ReadXml(XmlReader reader)
Parameters
reader XmlReader
XML reader
 WriteXml(XmlWriter)
Writes XML
public void WriteXml(XmlWriter writer)
Parameters
writer XmlWriter
XML writer
 Edit this page